This file contains architecture of default QuartzNet 
(as described in the paper) applied to [-1, 128, 1080] input.
This scheme was generated by torchsummary.summary().

----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv1d-1             [-1, 128, 540]           4,352
            Conv1d-2             [-1, 256, 540]          33,024
       BatchNorm1d-3             [-1, 256, 540]             512
              ReLU-4             [-1, 256, 540]               0
            Conv1d-5             [-1, 256, 540]           8,704
            Conv1d-6             [-1, 256, 540]          65,792
       BatchNorm1d-7             [-1, 256, 540]             512
              ReLU-8             [-1, 256, 540]               0
            Conv1d-9             [-1, 256, 540]           8,704
           Conv1d-10             [-1, 256, 540]          65,792
      BatchNorm1d-11             [-1, 256, 540]             512
             ReLU-12             [-1, 256, 540]               0
           Conv1d-13             [-1, 256, 540]           8,704
           Conv1d-14             [-1, 256, 540]          65,792
      BatchNorm1d-15             [-1, 256, 540]             512
             ReLU-16             [-1, 256, 540]               0
           Conv1d-17             [-1, 256, 540]           8,704
           Conv1d-18             [-1, 256, 540]          65,792
      BatchNorm1d-19             [-1, 256, 540]             512
             ReLU-20             [-1, 256, 540]               0
           Conv1d-21             [-1, 256, 540]           8,704
           Conv1d-22             [-1, 256, 540]          65,792
      BatchNorm1d-23             [-1, 256, 540]             512
           Conv1d-24             [-1, 256, 540]          65,792
      BatchNorm1d-25             [-1, 256, 540]             512
             ReLU-26             [-1, 256, 540]               0
       BasicBlock-27             [-1, 256, 540]               0
           Conv1d-28             [-1, 256, 540]          10,240
           Conv1d-29             [-1, 256, 540]          65,792
      BatchNorm1d-30             [-1, 256, 540]             512
             ReLU-31             [-1, 256, 540]               0
           Conv1d-32             [-1, 256, 540]          10,240
           Conv1d-33             [-1, 256, 540]          65,792
      BatchNorm1d-34             [-1, 256, 540]             512
             ReLU-35             [-1, 256, 540]               0
           Conv1d-36             [-1, 256, 540]          10,240
           Conv1d-37             [-1, 256, 540]          65,792
      BatchNorm1d-38             [-1, 256, 540]             512
             ReLU-39             [-1, 256, 540]               0
           Conv1d-40             [-1, 256, 540]          10,240
           Conv1d-41             [-1, 256, 540]          65,792
      BatchNorm1d-42             [-1, 256, 540]             512
             ReLU-43             [-1, 256, 540]               0
           Conv1d-44             [-1, 256, 540]          10,240
           Conv1d-45             [-1, 256, 540]          65,792
      BatchNorm1d-46             [-1, 256, 540]             512
           Conv1d-47             [-1, 256, 540]          65,792
      BatchNorm1d-48             [-1, 256, 540]             512
             ReLU-49             [-1, 256, 540]               0
       BasicBlock-50             [-1, 256, 540]               0
           Conv1d-51             [-1, 256, 540]          13,312
           Conv1d-52             [-1, 256, 540]          65,792
      BatchNorm1d-53             [-1, 256, 540]             512
             ReLU-54             [-1, 256, 540]               0
           Conv1d-55             [-1, 256, 540]          13,312
           Conv1d-56             [-1, 256, 540]          65,792
      BatchNorm1d-57             [-1, 256, 540]             512
             ReLU-58             [-1, 256, 540]               0
           Conv1d-59             [-1, 256, 540]          13,312
           Conv1d-60             [-1, 256, 540]          65,792
      BatchNorm1d-61             [-1, 256, 540]             512
             ReLU-62             [-1, 256, 540]               0
           Conv1d-63             [-1, 256, 540]          13,312
           Conv1d-64             [-1, 256, 540]          65,792
      BatchNorm1d-65             [-1, 256, 540]             512
             ReLU-66             [-1, 256, 540]               0
           Conv1d-67             [-1, 256, 540]          13,312
           Conv1d-68             [-1, 256, 540]          65,792
      BatchNorm1d-69             [-1, 256, 540]             512
           Conv1d-70             [-1, 256, 540]          65,792
      BatchNorm1d-71             [-1, 256, 540]             512
             ReLU-72             [-1, 256, 540]               0
       BasicBlock-73             [-1, 256, 540]               0
           Conv1d-74             [-1, 256, 540]          16,384
           Conv1d-75             [-1, 512, 540]         131,584
      BatchNorm1d-76             [-1, 512, 540]           1,024
             ReLU-77             [-1, 512, 540]               0
           Conv1d-78             [-1, 512, 540]          32,768
           Conv1d-79             [-1, 512, 540]         262,656
      BatchNorm1d-80             [-1, 512, 540]           1,024
             ReLU-81             [-1, 512, 540]               0
           Conv1d-82             [-1, 512, 540]          32,768
           Conv1d-83             [-1, 512, 540]         262,656
      BatchNorm1d-84             [-1, 512, 540]           1,024
             ReLU-85             [-1, 512, 540]               0
           Conv1d-86             [-1, 512, 540]          32,768
           Conv1d-87             [-1, 512, 540]         262,656
      BatchNorm1d-88             [-1, 512, 540]           1,024
             ReLU-89             [-1, 512, 540]               0
           Conv1d-90             [-1, 512, 540]          32,768
           Conv1d-91             [-1, 512, 540]         262,656
      BatchNorm1d-92             [-1, 512, 540]           1,024
           Conv1d-93             [-1, 512, 540]         131,584
      BatchNorm1d-94             [-1, 512, 540]           1,024
             ReLU-95             [-1, 512, 540]               0
       BasicBlock-96             [-1, 512, 540]               0
           Conv1d-97             [-1, 512, 540]          38,912
           Conv1d-98             [-1, 512, 540]         262,656
      BatchNorm1d-99             [-1, 512, 540]           1,024
            ReLU-100             [-1, 512, 540]               0
          Conv1d-101             [-1, 512, 540]          38,912
          Conv1d-102             [-1, 512, 540]         262,656
     BatchNorm1d-103             [-1, 512, 540]           1,024
            ReLU-104             [-1, 512, 540]               0
          Conv1d-105             [-1, 512, 540]          38,912
          Conv1d-106             [-1, 512, 540]         262,656
     BatchNorm1d-107             [-1, 512, 540]           1,024
            ReLU-108             [-1, 512, 540]               0
          Conv1d-109             [-1, 512, 540]          38,912
          Conv1d-110             [-1, 512, 540]         262,656
     BatchNorm1d-111             [-1, 512, 540]           1,024
            ReLU-112             [-1, 512, 540]               0
          Conv1d-113             [-1, 512, 540]          38,912
          Conv1d-114             [-1, 512, 540]         262,656
     BatchNorm1d-115             [-1, 512, 540]           1,024
          Conv1d-116             [-1, 512, 540]         262,656
     BatchNorm1d-117             [-1, 512, 540]           1,024
            ReLU-118             [-1, 512, 540]               0
      BasicBlock-119             [-1, 512, 540]               0
          Conv1d-120             [-1, 512, 540]          45,056
          Conv1d-121             [-1, 512, 540]         262,656
     BatchNorm1d-122             [-1, 512, 540]           1,024
            ReLU-123             [-1, 512, 540]               0
          Conv1d-124            [-1, 1024, 540]         525,312
     BatchNorm1d-125            [-1, 1024, 540]           2,048
            ReLU-126            [-1, 1024, 540]               0
          Conv1d-127              [-1, 28, 540]          28,700
================================================================
Total params: 5,501,468
Trainable params: 5,501,468
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.53
Forward/backward pass size (MB): 193.65
Params size (MB): 20.99
Estimated Total Size (MB): 215.16
----------------------------------------------------------------
